## Terraform Lint/Plan Results
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
cloudflare_zone_settings_override.tmeit-se-settings: Refreshing state... [id=6a806c0199e15cdf23bb3017a90bf149]
data.cloudflare_api_token_permission_groups.all: Reading...
cloudflare_record.mx-1: Refreshing state... [id=01b1e5831a61d592bb2a1fb51fc40a47]
cloudflare_record.mx-2: Refreshing state... [id=7539dc716260bb768658d6b61e54740e]
b2_bucket.tmeit-se-2011-dump: Refreshing state... [id=0351c5e9b99d1b0484480d18]
b2_bucket.terraform-state: Refreshing state... [id=c33185c9297d9b5484380d18]
b2_bucket.db-backups: Refreshing state... [id=531125b9d9ad0bd484480d18]
tls_private_key.terraform_access: Refreshing state... [id=2ffac8d1a1e85232461425b441d27bce00a220c3]
hcloud_firewall.myfirewall: Refreshing state... [id=572118]
data.cloudflare_api_token_permission_groups.all: Read complete after 1s [id=37f58c2e50041f9eed30c0006b111b44]
hcloud_server.node1: Refreshing state... [id=24978813]
hcloud_rdns.node1_ipv6: Refreshing state... [id=s-24978813-2a01:4f9:c012:6063::1]
cloudflare_record.www-aaaa: Refreshing state... [id=9f7b0d63a18b5513abb8db23ce62cd46]
hcloud_rdns.node1_ipv4: Refreshing state... [id=s-24978813-65.21.188.62]
cloudflare_api_token.dns_validation_token: Refreshing state... [id=c8a740fd710299e7612975c93125667d]
cloudflare_record.root-aaaa: Refreshing state... [id=eec58a7b6d17f1a40f411efb35d4da22]
b2_application_key.database-backup: Refreshing state... [id=00331599db448d80000000003]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # b2_application_key.database-backup is tainted, so must be replaced
-/+ resource "b2_application_key" "database-backup" {
      ~ application_key    = (sensitive value)
      ~ application_key_id = "00331599db448d80000000003" -> (known after apply)
      ~ id                 = "00331599db448d80000000003" -> (known after apply)
      ~ options            = [
          - "s3",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # b2_bucket.db-backups will be updated in-place
  ~ resource "b2_bucket" "db-backups" {
        id          = "531125b9d9ad0bd484480d18"
        # (7 unchanged attributes hidden)

      ~ lifecycle_rules {
          ~ days_from_hiding_to_deleting  = 365 -> 14
          ~ file_name_prefix              = "tmeit-db-backup-daily" -> "tmeit-db-backup-hourly"
            # (1 unchanged attribute hidden)
        }
      ~ lifecycle_rules {
          ~ days_from_hiding_to_deleting  = 14 -> 365
          ~ file_name_prefix              = "tmeit-db-backup-hourly" -> "tmeit-db-backup-daily"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # cloudflare_api_token.dns_validation_token will be updated in-place
  ~ resource "cloudflare_api_token" "dns_validation_token" {
        id          = "c8a740fd710299e7612975c93125667d"
        name        = "dns_validation_token2"
        # (4 unchanged attributes hidden)

      ~ condition {
          ~ request_ip {
              ~ in     = [
                  - "2a01:4f9:c012:6063::1/64",
                  - "65.21.188.62/32",
                ] -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # cloudflare_record.mx-1 will be created
  + resource "cloudflare_record" "mx-1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "mailcluster.loopia.se."
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.mx-2 will be created
  + resource "cloudflare_record" "mx-2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 20
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "mail2.loopia.se."
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.root-aaaa will be created
  + resource "cloudflare_record" "root-aaaa" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.www-aaaa will be updated in-place
  ~ resource "cloudflare_record" "www-aaaa" {
        id              = "9f7b0d63a18b5513abb8db23ce62cd46"
        name            = "www"
      ~ value           = "2a01:4f9:c012:6063::1" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # hcloud_rdns.node1_ipv4 must be replaced
-/+ resource "hcloud_rdns" "node1_ipv4" {
      ~ id         = "s-24978813-65.21.188.62" -> (known after apply)
      ~ ip_address = "65.21.188.62" -> (known after apply) # forces replacement
      ~ server_id  = 24978813 -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # hcloud_rdns.node1_ipv6 must be replaced
-/+ resource "hcloud_rdns" "node1_ipv6" {
      ~ id         = "s-24978813-2a01:4f9:c012:6063::1" -> (known after apply)
      ~ ip_address = "2a01:4f9:c012:6063::1" -> (known after apply) # forces replacement
      ~ server_id  = 24978813 -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # hcloud_server.node1 must be replaced
-/+ resource "hcloud_server" "node1" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "hel1-dc2" -> (known after apply)
      ~ id                         = "24978813" -> (known after apply)
      ~ ipv4_address               = "65.21.188.62" -> (known after apply)
      ~ ipv6_address               = "2a01:4f9:c012:6063::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f9:c012:6063::/64" -> (known after apply)
      - labels                     = {} -> null
        name                       = "node1"
      ~ status                     = "running" -> (known after apply)
      ~ user_data                  = "+8lcag9TYFm/HRQE67F++6QBhI0=" -> "R/tKFhslgdgAQjfSkj3Hb2mw9dQ=" # forces replacement
        # (10 unchanged attributes hidden)

      - public_net {
          - ipv4         = 0 -> null
          - ipv4_enabled = true -> null
          - ipv6         = 0 -> null
          - ipv6_enabled = true -> null
        }
      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

Plan: 7 to add, 3 to change, 4 to destroy.

Changes to Outputs:
  ~ b2-db-key-id     = "00331599db448d80000000003" -> (known after apply)
  # Warning: this attribute value will be marked as sensitive and will not
  # display in UI output after applying this change.
  ~ b2-db-key-secret = (sensitive value)
  ~ ipv4_address     = "65.21.188.62" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @JustinLex, Action: `pull_request`*